Бухгалтерия_обновление_тест1/src/ChartsOfCharacteristicTypes/АналитикиСтатейБюджетов/АналитикиСтатейБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>АналитикиСтатейБюджетов</name>
  <type>
    <types>CatalogRef.ВидыНоменклатуры</types>
    <types>EnumRef.ТипыЗатратРегл</types>
    <types>CatalogRef.ОбъектыЭксплуатации</types>
    <types>CatalogRef.МаркетинговыеМероприятия</types>
    <types>CatalogRef.Номенклатура</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    <types>CatalogRef.СтатьиКалькуляции</types>
    <types>CatalogRef.Сотрудники</types>
    <types>DocumentRef.ЗаказПоставщику</types>
    <types>CatalogRef.СерииНоменклатуры</types>
    <types>CatalogRef.НематериальныеАктивы</types>
    <types>CatalogRef.Валюты</types>
    <types>EnumRef.ТипыНоменклатуры</types>
    <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
    <types>CatalogRef.СегментыПартнеров</types>
    <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектовИерархия</types>
    <types>EnumRef.ТипыДенежныхСредств</types>
    <types>DocumentRef.ЗаказПереработчику</types>
    <types>CatalogRef.КассыККМ</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.КоллекцииНоменклатуры</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.ОбъектыСтроительства</types>
    <types>CatalogRef.ЦелевыеСредства</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
    <types>CatalogRef.Марки</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>DocumentRef.ЗаказНаСборку</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    <types>CatalogRef.Контрагенты</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    <types>CatalogRef.Партнеры</types>
    <types>EnumRef.ТипыНалогов</types>
    <types>CatalogRef.ПрочиеАктивыПассивы</types>
    <types>DocumentRef.ЗаказНаПеремещение</types>
    <types>CatalogRef.Производители</types>
    <types>CatalogRef.ФорматыМагазинов</types>
    <types>CatalogRef.ЦенныеБумаги</types>
    <types>CatalogRef.ЦеновыеГруппы</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>CatalogRef.Кассы</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    <types>CatalogRef.ДоговорыЛизинга</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.СезонныеГруппы</types>
    <types>CatalogRef.СегментыНоменклатуры</types>
    <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
    <types>CatalogRef.БизнесРегионы</types>
    <types>DocumentRef.ЗаказКлиента</types>
    <types>CatalogRef.Проекты</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.ПрочиеРасходы</types>
    <types>CatalogRef.Резервы</types>
    <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    <types>CatalogRef.ТоварныеКатегории</types>
  </type>
  <predefined>
    <items>
      <name>ВидыНоменклатуры</name>
      <description>Виды номенклатуры</description>
      <code>000000016</code>
      <type>
        <types>CatalogRef.ВидыНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>ГруппыАналитическогоУчетаНоменклатуры</name>
      <description>Группы аналитического учета номенклатуры</description>
      <code>000000034</code>
      <type>
        <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>ДенежныеСредстваБюджетирования</name>
      <description>Денежные средства</description>
      <code>000000011</code>
      <type>
        <types>CatalogRef.КассыККМ</types>
        <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
        <types>CatalogRef.Кассы</types>
      </type>
    </items>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
        <types>CatalogRef.ДоговорыЛизинга</types>
      </type>
    </items>
    <items>
      <name>Заказы</name>
      <description>Заказы</description>
      <code>000000036</code>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаказПереработчику</types>
        <types>DocumentRef.ЗаказНаСборку</types>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </items>
    <items>
      <name>КоллекцииНоменклатуры</name>
      <description>Коллекции</description>
      <code>000000033</code>
      <type>
        <types>CatalogRef.КоллекцииНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Марки</name>
      <description>Марки (бренды)</description>
      <code>000000028</code>
      <type>
        <types>CatalogRef.Марки</types>
      </type>
    </items>
    <items>
      <name>НаправленияДеятельности</name>
      <description>Направления деятельности</description>
      <code>000000015</code>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </items>
    <items>
      <name>НематериальныеАктивы</name>
      <description>Нематериальные активы</description>
      <code>000000018</code>
      <type>
        <types>CatalogRef.НематериальныеАктивы</types>
      </type>
    </items>
    <items>
      <name>НоменклатураБюджетирования</name>
      <description>Номенклатура</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>ОбъектыСтроительства</name>
      <description>Объекты строительства</description>
      <code>000000035</code>
      <type>
        <types>CatalogRef.ОбъектыСтроительства</types>
      </type>
    </items>
    <items>
      <name>ОбъектыЭксплуатации</name>
      <description>Объекты эксплуатации</description>
      <code>000000017</code>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </items>
    <items>
      <name>Организации</name>
      <description>Организации</description>
      <code>000000023</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>Партнеры</name>
      <description>Партнеры</description>
      <code>000000024</code>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </items>
    <items>
      <name>Подразделения</name>
      <description>Подразделения</description>
      <code>000000014</code>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </items>
    <items>
      <name>Проекты</name>
      <description>Проекты</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </items>
    <items>
      <name>Производители</name>
      <description>Производители</description>
      <code>000000027</code>
      <type>
        <types>CatalogRef.Производители</types>
      </type>
    </items>
    <items>
      <name>СтатьиАктивовИПассивов</name>
      <description>Прочие активы и пассивы</description>
      <code>000000019</code>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </items>
    <items>
      <name>ПрочиеРасходы</name>
      <description>Прочие расходы</description>
      <code>000000020</code>
      <type>
        <types>CatalogRef.ПрочиеРасходы</types>
      </type>
    </items>
    <items>
      <name>СезонныеГруппы</name>
      <description>Сезонные группы</description>
      <code>000000031</code>
      <type>
        <types>CatalogRef.СезонныеГруппы</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </items>
    <items>
      <name>СтатьиАктивовПассивов</name>
      <description>Статьи активов и пассивов</description>
      <code>000000022</code>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </items>
    <items>
      <name>СтатьиДвиженияДенежныхСредств</name>
      <description>Статьи ДДС</description>
      <code>000000007</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>СтатьиДоходов</name>
      <description>Статьи доходов</description>
      <code>000000009</code>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      </type>
    </items>
    <items>
      <name>СтатьиКалькуляции</name>
      <description>Статьи калькуляции</description>
      <code>000000008</code>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </items>
    <items>
      <name>СтатьиРасходов</name>
      <description>Статьи расходов</description>
      <code>000000010</code>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </items>
    <items>
      <name>ТипыДенежныхСредств</name>
      <description>Типы денежных средств</description>
      <code>000000012</code>
      <type>
        <types>EnumRef.ТипыДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>ТипыНоменклатуры</name>
      <description>Типы номенклатуры</description>
      <code>000000013</code>
      <type>
        <types>EnumRef.ТипыНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>ТоварныеКатегории</name>
      <description>Товарные категории</description>
      <code>000000030</code>
      <type>
        <types>CatalogRef.ТоварныеКатегории</types>
      </type>
    </items>
    <items>
      <name>ФизическиеЛица</name>
      <description>Физические лица</description>
      <code>000000021</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>ФорматыМагазинов</name>
      <description>Форматы магазинов</description>
      <code>000000032</code>
      <type>
        <types>CatalogRef.ФорматыМагазинов</types>
      </type>
    </items>
    <items>
      <name>ЦеновыеГруппы</name>
      <description>Ценовые группы</description>
      <code>000000029</code>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>ЗаполнениеВалюты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеЕдиницыИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВалюты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЕдиницыИзмерения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПоВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПоКоличеству</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеСвойство</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеТипаЗначения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

Бухгалтерия_обновление_тест1/src/ChartsOfCharacteristicTypes/АналитикиСтатейБюджетов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьУникальностьИдентификатора(Отказ);
	
	Если УчитыватьПоВалюте Тогда
		ПроверяемыеРеквизиты.Добавить("ЗаполнениеВалюты");
	КонецЕсли;
	
	Если УчитыватьПоКоличеству Тогда
		ПроверяемыеРеквизиты.Добавить("ЗаполнениеЕдиницыИзмерения");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Идентификатор = "";
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Процедура ПроверитьУникальностьИдентификатора(Отказ)
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		
		ИдентификаторПеременная = Истина;
		ПроверочныйИдентификатор = БюджетнаяОтчетностьКлиентСервер.ПолучитьИдентификатор(Идентификатор);
		Если НЕ ПроверочныйИдентификатор = Идентификатор Тогда
			ТекстСообщения = НСтр("ru='Идентификатор не соответствует правилам именования переменных.
|Идентификатор не должен содержать пробелов и специальных символов и не должен начинаться с цифры.'
|;uk='Ідентифікатор не відповідає правилам іменування перемінних.
| Ідентифікатор не повинен містити пробілів і спеціальних символів і не повинен починатися з цифри.'");
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Идентификатор),
				ЭтотОбъект,
				"Идентификатор",, Отказ);
			ИдентификаторПеременная = Ложь;
		КонецЕсли;
		
		Если ИдентификаторПеременная Тогда
			ЗарезервированныеПеременные = БюджетнаяОтчетностьКлиентСервер.ПеременныеБюджетныхОтчетов();
			Если ЗарезервированныеПеременные.Свойство(Идентификатор) Тогда
				ТекстСообщения = НСтр("ru='Идентификатор аналитики не может совпадать со значением параметра ""%1"".';uk='Ідентифікатор аналітики не може збігатися зі значенням параметра ""%1"".'");
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ТекстСообщения,
						Идентификатор),
					ЭтотОбъект, "Идентификатор",, Отказ);

			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
					|	АналитикиСтатейБюджетов.Ссылка
					|ИЗ
					|	ПланВидовХарактеристик.АналитикиСтатейБюджетов КАК АналитикиСтатейБюджетов
					|ГДЕ
					|	АналитикиСтатейБюджетов.Ссылка <> &Ссылка
					|	И АналитикиСтатейБюджетов.Идентификатор = &Идентификатор";
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				Запрос.УстановитьПараметр("Идентификатор", Идентификатор);

				Результат = Запрос.Выполнить();
				Если НЕ Результат.Пустой() Тогда
					ТекстСообщения = НСтр("ru='В базе данных уже содержится вид аналитики с идентификатором ""%1"". Идентификатор должен быть уникальным';uk='У базі даних вже міститься вид аналітики з ідентифікатором ""%1"". Ідентифікатор повинен бути унікальним'");
					ОбщегоНазначения.СообщитьПользователю(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							ТекстСообщения,
							Идентификатор),
						ЭтотОбъект, "Идентификатор",, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
